/**
 * 常用正则表达式
 */
const Reg = {
  num: /^(-)?\d+$/, // 数字
  znum: /^[1-9](\d+)?$/, // 大于0的数字
  float: /^\d+(?:\.\d+)?$/, // float
  money: /^\d{1,12}(?:\.\d{1,2})?$/, // money
  idCard: /^\d{15}$|^\d{18}$|^\d{17}[xX]$/, // 身份证
  qq: /^[1-9]\d{4,15}$/, // QQ
  pwd: /^[\w\W]{6,20}$/, // 密码为6-20位，由字母、数字和符号组成！
  areacode: /^(0[1,2]{1}\d{1})$|^(0[3-9]{1}\d{2})$/, // 区号
  tel: /^\d{7,8}$/, // 固话格式
  mobile: /^((\+86)|(\(\+86\)))?-?1([3-9])[0-9]{9}$/, // 验证手机号码
  telephone: /^((\+86)|(\(\+86\)))?-?(((0[1,2]{1}\d{1})?-?\d{8})|((0[3-9]{1}\d{2})?-?\d{7,8}))$/, // 验证固定电话
  phone: /^((\+86)|(\(\+86\)))?-?1([3-9])[0-9]{9}$|^((\+86)|(\(\+86\)))?-?(((0[1,2]{1}\d{1})?-?\d{8})|((0[3-9]{1}\d{2})?-?\d{7,8}))$/, // 手机号码和固定电话
  zipcode: /^[1-9]\d{5}$/, // 验证邮编
  email: /^\w{1,16}([-+.']\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/, // 邮箱
  chinese: /^[\u4E00-\u9FA5]+$/, // 仅汉字
  char: /^[A-Za-z]+$/, // 仅仅是字母
  charn: /^[A-Za-z0-9]+$/, // 数字加字母
  nospecial: /^[\u4E00-\u9FA5A-Za-z0-9]+$/, // 不包含特殊字符
  loginName: /^[\w\W\u4e00-\u9fa5]{5,20}$/, // 姓名
  userName: /^[a-zA-Z0-9\u4e00-\u9fa5]{1,20}$/,
};

export default Reg;
